{
    "title": "A32NX CHANGELOG",
    "list": [
        {
            "version": "0.4.0",
            "date": "2020-10-14",
            "features": [
                "[CDU] Add \"Closest Airports\" page - @lhoenig (Lukas Hoenig)",
                "[CDU] Add approach waypoints to DCT page - @lengyc0208 (lyc)",
                "[CDU] Add IRS INIT page - @externoak (Externo)",
                "[CHECKLISTS] Added several situations from QRH to checklists - @FBI#7771",
                "[DCDU] Add basic functionality and display - @Benjozork (Benjamin Dupont)",
                "[ECAM] Added cockpit door video - @Benjozork (Benjamin Dupont)",
                "[ECAM] Added engine FADEC power supply logic - @tyler58546 (tyler58546)",
                "[ECAM] Added messages related to anti-skid / N.W. steering being off - @Benjozork (Benjamin Dupont)",
                "[ECAM] Added spoiler functionality to ECAM page - @wpine215 (Iceman)",
                "[GPWS] Added Pull Up, Sink Rate, Dont sink GPWS with default sounds - @oliverpope03 (Oliver Pope)",
                "[LIVERY] Bundle the FlyByWire livery - @devsnek (devsnek)",
                "[ND] Added WX/TERR on ND brightness knob, fix ND/PFD brightness tooltips - @lukecologne (luke)",
                "[OVHD] Implement additional overhead button/switch functionality (EMER ELEC, EVAC, air data switching, etc.) - @wpine215 (Iceman)",
                "[OVHD] Implemented missing functionality for multiple overhead buttons and switches - @wpine215 (Iceman)",
                "[PFD] Added the ability to display metric altitudes - @lousybyte (lousybyte)",
                "[SAI] Added brightness adjustment and attitude reset - @2hwk (2Cas#1022 on discord)",
                "[SAI] Added bugs page - @2hwk (2Cas#1022 on discord)",
                "[SOUND] Added 3D emitters for all sounds - @hotshotp (Boris)",
                "[SOUND] Added new sounds for fuel pumps, flaps, ground roll and rattles, touchdowns, and wind - @hotshotp (Boris)",
                "[SOUND] Added new startup sounds - @hotshotp (Boris)",
                "[SOUND] Added sounds for EVAC horn, EMER cabin call, mech horn, gear extend/retract, and cargo door - @hotshotp (Boris)",
                "[MISC] Separated Captian and F/O displays - @tyler58546 (tyler58546)",
                "[MISC] New custom display font for PFD/ND/ECAM/MCDU, unified CSS and colours of ECAM pages - @wpine215 (Iceman)"
            ],
            "improvements": [
                "[CDU] Improved the VERT REV page - @lousybyte (lousybyte)",
                "[CDU] Revised INIT A & B Page - @lucky38i (Lucky38i)",
                "[CDU] Revised blue, green and amber colours on CDU - @lucky38i (Lucky38i)",
                "[CDU] Updated HOLD Page to honeywell spec, PLAN page updated to show holds - @sepiroth887 (sepiroth887)",
                "[ECAM] Improved APU ECAM visuals - @wpine215 (Iceman)",
                "[ECAM] Improved BLEED ECAM page visuals and functionality - @nikotina91",
                "[ECAM] Improved FUEL ECAM page visuals and corrected center pump inconsistency - @wpine215 (Iceman)",
                "[ECAM] Improved ENGINE ECAM page - @lousybyte (lousybyte)",
                "[ECAM] Overhauled WHEEL ECAM page - @Benjozork (Benjamin Dupont)",
                "[ECAM] Improved ELAC/SEC warning colour - @wpine215 (Iceman)",
                "[ND] Change ND sizing - @nathaninnes (Nathan Innes)",
                "[PFD] Adjust vertical Flight Director offset - @veikkos (Veikko Soininen)",
                "[PFD] Correct PFD attitude indicator onground/inflight - @MMontalto (PiCcy)",
                "[LIGHTS] Improved Strobe, Nav and beacon lights - @lukecologne (lukecologne)",
                "[SYSTEMS] Pitot heating should now be active while engines are running - @lousybyte (lousybyte)"
            ],
            "fixes": [
                "[CDU] Fixed certain STARs not showing on arrivals page - @tyler58546 (tyler58546)",
                "[CDU] Follow green dot speed on approach with flaps clean - @veikkos (Veikko Soininen)",
                "[ECAM] Fixed ECAM wheel page being selected before all gears are downlocked - @lukecologne (luke)",
                "[ECAM] Made open doors on DOOR/OXY page amber instead of green - @Benjozork (Benjamin Dupont)",
                "[FCU] Fixed incrementing the QNH while in hPa mode - @lousybyte (lousybyte)",
                "[LIGHTS] Fixed DIM/BRT Lights inside the cockpit - Overhead should now be visible - @Snapmatics (Harry)",
                "[OVHD] Fixed battery indicator colour - @nathaninnes (Nathan Innes)",
                "[OVHD] Made AIR COND knobs continuous - @Benjozork (Benjamin Dupont)",
                "[PFD] Fix Radio altimeter only updating every second - @lukecologne (luke)",
                "[PFD] Fixed FD bars appearing on PFD when on the ground - @Curtis-VL (Curtis)",
                "[ND] Fixed cyan heading bug not showing on ND in VOR and LS modes - @AdenFlorian (David Valachovic)",
                "[ND] Hide the aircraft indicator in PLAN mode while ADIRS are not aligned - @lousybyte (lousybyte)",
                "[TEXTURES] Changed overhead panel texture (decals, colour, detail) - @Pleasure0102 (Pleasure)",
                "[TEXTURES] Changed colour of FD Panel - @Pleasure0102 (Pleasure)",
                "[TEXTURES] Changed texture of glareshield and added details - @Pleasure0102 (Pleasure)",
                "[TEXTURES] Fixed Speed Plaque and cleaned up texture on cockpit, some colour corrections and more decals - @Pleasure0102 (Pleasure)",
                "[TEXTURES] Higher resoloution main panel, fixed glareshield texture error - @Pleasure0102 (Pleasure)",
                "[SAI] Fixed font and behaviour on power loss - @2hwk (2Cas#1022 on discord)",
                "[SAI] Standby Instrument stays ON if emergency power should be available, other bug fixes - @2hwk (2Cas#1022 on discord)",
                "[MISC] Removed fuel patch for MSFS update 1.8.3 - @nathaninnes (Nathan Innes)",
                "[PFD] Remove code related to irrelevant aircraft - @1Revenger1 (Avery Black)"
            ]
        },
        {
            "version": "0.3.1",
            "date": "2020-09-30",
            "fixes": [
                "[EXTERIOR] Fixed issue in engine rotation animation that made it rotate too quickly - @lukecologne (lukecologne)",
                "[MISC] Fixed mod so that it works with MSFS 1.9.3 - @DoToAdventures @tyler58546 @AdenFlorian",
                "[MCDU] Fixed several issues related to incorrect active waypoints - @lousybyte (lousybyte)",
                "[MCDU] Fixed a crash when trying to replace a waypoint in the flight plan - @lousybyte (lousybyte)"
            ],
            "features": [
                "[MISC] Add CHANGELOG.md - @nathaninnes (Nathan Innes)",
                "[ND] Add DME distances, VOR/ADF needles and functioning ADF2 - @blitzcaster (bltzcstr)"
            ],
            "improvements": [
                "[ECAM] Improved Upper ECAM Visuals - @wpine215 (Iceman)",
                "[ECAM] Lower ECAM DOOR Page Colour Fix - @nathaninnes (Nathan Innes)",
                "[PFD] Remove code related to unrelevant aircraft - @1Revenger1 (Avery Black)",
                "[TEXTURES] Changed roughness of glareshield - @Pleasure (Pleasure)"
            ]
        },
        {
            "version": "0.3.0",
            "date": "2020-09-26",
            "fixes": [
                "[ECAM] Fix the default GW on Lower EICAS not update in realtime.",
                "[ECAM] Fixed fuel display on ECAM, They now have a precision of 20kg for fuel remaining and 10kg for fuel used.",
                "[FMA] Fix the behaviour of the LVR CLB thrust callout on the FMA.",
                "[FMA] Fix LVR CLB warning not showing up when in Climb phase.",
                "[FMA] Fix FMA boxes.",
                "[LIGHTS] Fixes ILS button brightness.",
                "[LIGHTS] Fixes the beacon lights so they won't bleed into the cockpit.",
                "[MCDU] Fix CHG Code to read A20N instead of A2N.",
                "[MCDU] Fix DES phase so it will actually be activated.",
                "[MCDU] Fix visual flaw with FUEL PRED ZFW/ZFWCG.",
                "[MCDU] This fixes the green dot speed that is displayed on the PERF TAKEOFF and APPROACH pages of the MCDU.",
                "[MCDU] Fix takeoff speed to V2+10.",
                "[MISC] Tooltips fixes.",
                "[MISC] General delta time fixes so that things won't break with FPS fix mods.",
                "[MISC] Fix FD default to on on runway.",
                "[MISC] Fixed ATHR unstable on TOGA.",
                "[MISC] Fix Landing gear Indicator text illumination (red UNLK).",
                "[MISC] Temporary fix for engine 1 fuel flow being cut off during APU shutdown.",
                "[MISC] Fix incorrect slat position after 1.8.3.",
                "[MISC] Temporary fix for brightness knobs from changing seemingly randomly after 1.8.3.",
                "[ND] Text position fixes, makes texts flush with screen edges"
            ],
            "features": [
                "[ATC] Added background lighting and realistic size.",
                "[ECAM] ECAM messages area has been completely redone.",
                "[ECAM] Messages can now show on the right side of the ECAM.",
                "[ECAM] Messages will now show in a consistent order.",
                "[ECAM] Added many new ECAM messages: T.O. INHIBIT, LDG INHIBIT, APU BLEED, APU AVAIL, LDG LT, SPEED BRK, AUTO BRK LO, AUTO BRK MED, AUTO BRK MAX.",
                "[ECAM] Added takeoff memo. Shows 2 mins after second engine start. Hides after takeoff thrust application.",
                "[ECAM] Added landing memo. Shows below 2000 feet during approach phase. Hides after slowing down below 80kts.",
                "[ECAM] Added support for failures to show on ECAM.",
                "[ECAM] Added NAV TCAS FAULT failure when ADIRS are not aligned.",
                "[ECAM] Added CAB PR EXCESS CAB ALT failure when cabin altitude exceeds 10000ft (can only be triggered by slewing to an extreme altitude).",
                "[ECAM] Added CABIN......CHECK to ECAM memos. Changes to CABIN READY when ALL, FWD, or AFT call button is pressed. Resets when flight phase changes.",
                "[ECAM] Added functional CLR and RCL buttons.",
                "[ECAM] Master caution/warning will now automatically deactivate when messages are removed from ECAM.",
                "[ECAM] Adds ECAM procedures for fire tests.",
                "[ECAM] Adds functionality to the F/CTL rudder indicator.",
                "[ECAM] Added new secondary ECAM memo for wing anti-ice and engine anti-ice.",
                "[ECAM] Added new secondary ECAM memo for GPWS Flaps 3 mode (tied to INOP Flaps 3 push button).",
                "[ECAM] Added new secondary ECAM memo for Hydraulic PTU, which is displayed when the PTU sound plays.",
                "[ECAM] Adds NW STRG DISC memo when in pushback.",
                "[ECAM] Added 'TCAS STBY' on Right Upper ECAM Memo.",
                "[ECAM] ECAM Cruise page.",
                "[ECAM] When at least one engine is running and predictive windshear is turned off, a secondary ECAM memo will appear.",
                "[ECAM] When above 50 ft RA, the memo will turn amber.",
                "[ECAM] Created a wheel page for ECAM, handles break temp, landing gear indicating , and spoilers.",
                "[ECAM] Adds dynamic switching of ECAM pages when no page is selected.",
                "[ECAM] Added ECAM status page.",
                "[ECAM] Added new failures: ENG DUAL FAILURE, ENG 1(2) FIRE (airborne), ENG 1(2) FAIL, ENG 1(2) SHUT DOWN, BRAKES HOT.",
                "[ECAM] Normal messages on the ECAM will now be hidden when a failure is shown.",
                "[ECAM] Added ECAM overflow arrow.",
                "[ECAM] Added ECAM status reminder.",
                "[ECAM] Added automatic page switching during a failure.",
                "[FCU] Added background lighting at night.",
                "[FMA] Adds support for 'G/S*' and 'LOC *' FMA modes.",
                "[LIGHTS] Enhanced overall cockpit lighting and tweaked few exterior lighting.",
                "[LIGHTS] Added display back light for all main screens such as PFD, ND, ECAM, MCDU.",
                "[LIGHTS] The display back lights will now illuminate surrounding cockpit, controlled by the individual brightness knobs.",
                "[LIGHTS] Enhanced the glare shield lights, the shape and the color is modified.",
                "[LIGHTS] Glare shield light will now increase/decrease the ambient light of the cockpit.",
                "[LIGHTS] Enhanced the dome lights, corrected the light angle, color, spread and intensity.",
                "[LIGHTS] Volumetric Strobe lights and enhanced its range and intensity.",
                "[LIGHTS] Volumetric navigation lights.",
                "[LIGHTS] Enhanced the logo lights intensity.",
                "[MCDU] Create waypoint vertical revision page frontend.",
                "[MCDU] The AIRWAYS page should properly show just the enroute waypoints after the current selected one and not all of them. Players are now able to manually enter as many airway connected waypoints as needed.",
                "[MCDU] Added limited altitude restriction editing functionality.",
                "[MCDU] Automatically calculate TOW if possible.",
                "[MCDU] Automatically fill in thrust reduction altitude and acceleration altitude based on runway height.",
                "[MCDU] Add better input validation for FLAP/THS. Flap setting is limited to 1-3. THS now limited to a max of 2.5.",
                "[MCDU] Add better parsing for FLAP/THS. Flap is now optional input. (e.g. /UP0.5 is a valid input now) THS can be written with UP/DN at either the start OR end of the input. THS number can be written as 0.1, .1, or even in plain whole numbers like 1.",
                "[MISC] Set defaults for seatbelt light, FD, and ATC switches.",
                "[MISC] Adds an emergency light light when off.",
                "[MISC] Adds 5 INOP GPWS buttons with variables ready for use.",
                "[MISC] Adds 3 call buttons and 1 inop (mech sound needed).",
                "[MISC] Cabin call buttons are now push and hold. Sound plays when pressed. ",
                "[MISC] Adds 'Cabin Crew seats for landing please' when chime is first pressed after entering the landing phase.",
                "[MISC] Adds 'Cabin Crew Seats for takeoff please' when 'cabin......Check' and 'TO Config' are green on takeoff memo.",
                "[MISC] Adds fire tests for ENG 1, ENG 2, APU, Cargo Smoke.",
                "[MISC] Right side wiper switch now operable (Still synced with Left Switch).",
                "[MISC] Add INOP predictive windshear switch (dummy switch).",
                "[MISC] Implement ANN LT TEST.",
                "[MISC] Added dummy switch for TCAS.",
                "[MISC] Display barometer readout on ISIS.",
                "[MISC] Added working engine fire buttons.",
                "[MISC] Added Fire Buttons lighting up on test.",
                "[MISC] Added Dummy AudioSwitching knob on top overhead.",
                "[MISC] Added Cockpit Door switch (spring loaded) + Open Light.",
                "[MISC] Adds animation, emission seqs to the overhead Commercial and Galy&Cab pushbuttons.",
                "[MISC] SAI/Integrated Standy Instrument Self Test.",
                "[MISC] Add animation, sounds, emission to Elec pushbuttons.",
                "[MISC] Added Correct Caution and Warning audio.",
                "[ND] Make ND compass spin after alignment.",
                "[PFD] Added compass ticks below horizon as well as selected heading tick right above horizon (which only shows when FD are off).",
                "[PFD] Add ground mode sidestick cursor.",
                "[PFD] Makes it so the altimeter on the PFD smoothly animates to the current altitude (from 0) once the altimeter becomes avail during alignment.",
                "[FMA] Disabled LVR MCT FMA until we can implement it properly.",
                "[ND] Hide BingMap on ND when no weather or terrain."
            ],
            "improvements": [
                "[ADIRS] IRS alignment times based on latitude have been re-calculated.",
                "[ADIRS] IRS alignment ECAM memo now skips 'IR IN ALIGN 0 MN' to match the real aircraft.",
                "[ADIRS] IRS alignment ECAM memo now skips 'IR IN ALIGN 7 MN' to match the real aircraft.",
                "[ADIRS] IRS alignment ECAM memo now rounds up when converting seconds to minutes.",
                "[ADIRS] GPWS Terrain button now displays FAULT when IRS not aligned.",
                "[ADIRS] GPWS Sys button now displays FAULT when IRS not aligned.",
                "[CHECKLISTS] Streamlined checklists, added highlighting where possible.",
                "[CHECKLISTS] Added Checklist highlighting for a lot of things.",
                "[CHECKLISTS] Made checklists mostly interactive.",
                "[CHECKLISTS] Added Checklist evaluation for PWS, Seatbelts, Smoking, ADIRS, Emergency Exit Light Switches.",
                "[ECAM] APU Guage now features a dynamic EGT warning marker. Increased gauge px thickness by 1px.",
                "[ECAM] Correct the orientation for the valves in the lower ENGINE ECAM.",
                "[ECAM] Small redesign for the F/CTL rudder axis, add moving rudder limit.",
                "[ECAM] Changes LDG LT memo logic so that the memo is shown when at least one landing light is extended.",
                "[ECAM] The F/CTL ECAM page will now have controls amber when both engines are not started.",
                "[ECAM] Do not show 'REV' and thrust limit % when thrust reversers are active.",
                "[ECAM] Acceleration altitude should be MSL instead of AGL.",
                "[ECAM] When ECAM STS page is selected, the light on the button is now illuminated.",
                "[ECAM] When there are failures to clear, the ECAM CLR light illuminates.",
                "[ECAM] Backlight of ECAM CLR, RCL, STS and ALL buttons backlight now working.",
                "[FCU] FCU design changes to more closely match IRL.",
                "[FMA] Make some FMAs have permanent box (like MAN TOGA).",
                "[LIGHTS] Made it so the eng starters and the parking brake are not emissive.",
                "[LIGHTS] Now, Runway Turnoff Lights do not illuminate the cockpit interior after landing gear is retracted.",
                "[LIGHTS] Improves the Exterior Lights so you can see further on Take Off/Landing/Taxi.",
                "[LIGHTS] Sets default screen brightness in C&D start to 0.1 (first setting).",
                "[LIGHTS] Changed the saturation and brightness of the emission decals to more closely reflect real counterparts.",
                "[MCDU] Make GPS and Position Monitor CDU pages dynamic, cosmetics/realism.",
                "[MCDU] Remove decimals from flight plan altitude FL constraints.",
                "[MCDU] Show proper constraints for waypoints in the flight plan page.",
                "[MCDU] Switch to flight level display if alt is higher than trans alt in the flight plan page.",
                "[MCDU] Make TAXI fuel default value from 'empty' to '0.2' as per commonly used AMI.",
                "[MCDU] VSpeeds are now manually changeable.",
                "[MCDU] VSpeeds can be automatically calculated by clicking a speed option with an empty input, and pressing it again to confirm the result.",
                "[MCDU] VSpeed auto-calculation prefers to look at MCDU's flap setting over the current flaps of the plane.",
                "[MCDU] The AIRWAYS page should properly show just the enroute waypoints after the current selected one and not all of them. Players are now able to manually enter as many airway connected waypoints as needed.",
                "[MISC] Changed landing light indicators to be independent instead of being based off the centre gear position.",
                "[MISC] Puts the panels in 'self-test' mode after the knob has been turned from off to another position.",
                "[MISC] Also sets strobe light to auto (was ON) for runway spawn.",
                "[MISC] Updated engine N1, EGT and Oil pressure values to match A320Neo engine limits.",
                "[MISC] N1 and EGT now have dynamic limits based on throttle state(arrow does not turn red beyond 100%N1 on TOGA upto 101.5% for 5min).",
                "[MISC] TOGA state limits on N1 and EGT are only allowed upto 5min on both engines after which it comes down to MCT limits.",
                "[MISC] Corrects chrono reset behavior so it behaves realistically.",
                "[MISC] Prevent APU activation when there's no power.",
                "[MISC] Set TCAS switch to TA/RA by default when spawning on runway, cruise, approach, or final. STBY otherwise.",
                "[MISC] Pressing IDENT no longer causes an empty value input into the transponder.",
                "[MISC] Changed the v/s alert threshold according to the Airbus FCOM.",
                "[MISC] Modified date & middle digits displays.",
                "[MISC] Created custom engine fan animation templates that use N1 instead of some other wrong RPM.",
                "[MISC] Reverted some flight model changes from 1.8.3.",
                "[MISC] Changes in rudder steering speeds authority and max steering angle.",
                "[MISC] Lowers VMO to 350.",
                "[MISC] Sync VMAX on PFD with overspeed warning.",
                "[ND] If you are below 100kts ground speed the wind indicator on the ND will not show.",
                "[ND] Display Waypoint ETA in UTC.",
                "[PFD] Change the viewbox for the attitude lines to make horizon and attitude lines move with each other.",
                "[PFD] Change the seperator between bottom and top horizon y and thickness to make it centered and match closer to an actual PFD.",
                "[PFD] Reduce medium/short pitch line width to closer match actual PFD.",
                "[PFD] Make speed tape more responsive.",
                "[PFD] Added STD (Boxed)/QNH display.",
                "[PFD] QNH legend is separated from value, so QNH can be in white.",
                "[PFD] Added small > for each alt in the alt scale.",
                "[PFD] The alt display window is now yellow as it should be.",
                "[PFD] The target alt cursor has been resized.",
                "[PFD] The target altitude has been aligned to the left of the alt scale.",
                "[PFD] Yellow aircraft symbol bigger and more accurate.",
                "[PFD] Bank triangle at top now yellow and hollow.",
                "[RTPI] Changed size and position of digits (enlarged =).",
                "[RTPI] Added a lighting background at night.",
                "[RTPI] There is no longer negative values displayed when trimming to the left."
            ]
        },
        {
            "version": "0.2.0",
            "date": "2020-09-04",
            "fixes": [
                "[APU] APU start logic adjusted",
                "[APU] APU EGT is now adjusted for ambient temperature",
                "[APU] Smoothened APU EGT curve",
                "[APU] APU bleed now momentarily drops when bleed valve is opened",
                "[BRAKES] Fixed accumulator pressure changing when on battery",
                "[ECAM] Bleed ECAM page implemented",
                "[ECAM] Initializes on DOOR page instead of FUEL",
                "[ELEC] Battery display is now always on and displays battery voltage instead of main bus voltage",
                "[FCU] Altitude selection knob no longer requires explicit push/pull interaction to update new altitude target",
                "[FCU] Increased size of managed mode indicators",
                "[FCU] Adjusted alignment of altitude and vertical speed displays",
                "[FMA] Corrected '1FD2' to '1 FD 2' on FMA",
                "[FMA] Fixed 'SPEED' appearing whilst on the ground and A/THR requiring AP",
                "[FMA] Fixed various issues with thrust modes appearing incorrectly",
                "[FMA] Fixed thrust modes appearing when in GS or VS modes",
                "[FMA] Fixed 'SRS' appearing as armed, fixed 'SRS' disengagement conditions",
                "[FMA] 'SPEED' no longer appears with autopilot/auto-throttle disengaged",
                "[FMA] 'NAV', 'CLB', and 'DES' no longer appear with flight directors disabled",
                "[FMA] Fixed 'SPEED' and 'MACH' flickering at cruise",
                "[FMA] Improved 'OP DES' and 'OP CLB' trigger logic",
                "[FMA] Fixed 'CLB' and 'DES' appearing at incorrect times as well as on ground",
                "[FMA] Fixed 'NAV' not appearing with AP disengaged",
                "[FMA] Fixed 'ALT' in blue not appearing when changing altitudes",
                "[FMA] Fixed 'ROLLOUT' appearing after leaving the runway",
                "[FMA] Fixed 'GS' appearing with no FD's active",
                "[FMA] Fixed 'A/THR' appearing enabled on the ground",
                "[FMA] Fixed 'MACH' appearing on the ground",
                "[FMA] Fixed 'SPEED' and 'MACH' not appearing in some situations",
                "[FMA] Fixed 'THR LVR' and 'THR IDLE' not appearing in some situations",
                "[FMA] Decreased sensitivity for 'THR CLB' appearing on the FMA.",
                "[FMA] Fixed 'THR IDLE' not appearing when descending",
                "[FMA] Fixed 'THR LVR' appearing when in cruise phase",
                "[FMA] Fixed 'SPEED' not appearing with AP off but A/THR on",
                "[FMA] Fixed AP and FD FMA modes appearing green instead of white.",
                "[FMA] Fixed 'FINAL APP', 'LAND', 'FLARE', 'ROLLOUT' appearing with FD off",
                "[FMA] Fixed a situation where 'SPEED' wouldn't appear",
                "[FMA] Fixed 'HDG' appearing when on the ground",
                "[FMA] Fixed 'SINGLE' and 'DUAL' not appearing on ILS approaches",
                "[FMA] Fixed 'CAT' not appearing on FMA, improved logic to match ICAO criteria.",
                "[FMA] Corrected logic for engaging ILS categories.",
                "[LIGHTS] Brightness knobs for PFD, MFD, ECAM, FCU, and overhead panel are turned down when spawning cold-and-dark",
                "[LIGHTS] Reduced ambient cockpit lighting",
                "[MFD] Adjusted look of wind arrow on navigation display",
                "[PERF] Overpowered engine thrust reduced",
                "[PERF] Fuel consumption improved",
                "[TEXTURES] Adjusted textures for panels, pedestal, and cockpit decals",
                "[TEXTURES] Adjusted colors on overhead panel"
            ],
            "features": [
                "[ADIRS] Added ADIRS knob functionality",
                "[ADIRS] Added ADIRS ALIGN light functionality",
                "[ADIRS] IRS alignment affects PFD and MFD displays and indicators",
                "[ADIRS] IRS alignment affects TAT and SAT indicators on lower ECAM",
                "[ADIRS] IRS alignment time dependent on latitude",
                "[ADIRS] IRS alignment time remaining displays on upper ECAM",
                "[BRAKES] Brake gauge now properly reflects status of toe brakes and parking brakes",
                "[ECAM] Added F/CTL ECAM page with support for elevator, aileron, and pitch trim movements",
                "[ECAM] F/CTL ECAM reflects current ELAC and SEC status",
                "[ECAM] Lower ECAM automatically switches to DOOR page when a door is opened",
                "[ECAM] Lower ECAM automatically switches to APU page when APU master is switched on",
                "[ECAM] Added ECAM memos 'GND SPLRS ARMED', 'SEAT BELTS', and 'NO SMOKING'",
                "[MFD] Added range change indicator to navigation display",
                "[MISC] PFD, MFD, and ECAM displays now present a self-test upon powering up",
                "[MISC] PFD, MFD, ECAM, and MCDU displays no longer work only on battery - require external power or APU/engine generators",
                "[MISC] Added seatbelt sign switch functionality",
                "[MISC] Added no smoking sign switch functionality (full range of motion currently restricted)",
                "[MISC] Added moveable dummy knobs for cockpit, fwd, and aft cabin air conditioning controls",
                "[SOUND] Added chimes for seatbelt and no smoking switches"
            ],
            "improvements": [
                "[LIGHTS] Taxi light no longer bleeds into cockpit",
                "[SOUND] Removed 70ft and 60ft radio altimeter callouts"
            ]
        },
        {
            "version": "0.1.1",
            "date": "2020-08-24",
            "fixes": [],
            "features": [],
            "improvements": [
                "[MISC] Re-organized into standalone community package"
            ]
        },
        {
            "version": "0.1.0",
            "date": "2020-08-23",
            "fixes": [
                "[ECAM] Removed INOP property from all ECAM page buttons"
            ],
            "features": [
                "[ECAM] APU ECAM page",
                "[ECAM] Door ECAM page",
                "[ECAM] Bleed ECAM page placeholder",
                "[MFD] MODE change indication in navigation display"
            ],
            "improvements": [
                "[PERF] Decreased fuel consumption",
                "[PERF] Increased APU startup time"
            ]
        }
    ]
}
